tutorials/electrochemistry/flowAroundBattery/constant/amb/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


// Density - Dimensions: kg/m3
rho             rho [1 -3 0 0 0 0 0] 1.0;

mu              mu [ 1 -1 -1 0 0 0 0 ] 0.0002;

// Specific heat - Dimensions: J/kg-K
cp              cp  [0 2 -2 -1 0 0 0] 250.0;


// Thermal conductivity - Dimensions: W/m-K
k            	k   [1 1 -3 -1 0 0 0] 5.0;

// ************************************************************************* //
