tutorials/electrochemistry/flowAroundBattery/constant/cell/electrochemicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          electrochemicalProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


//- fitting parameter a0 for fit U0 - Dimensions: V
a0              a0 [1 2 -3 0 0 -1 0] 4.12;

//- fitting parameter a1 for fit U0 - Dimensions: V
a1              a1 [1 2 -3 0 0 -1 0] -0.804;

//- fitting parameter a2 for fit U0 - Dimensions: V
a2              a2 [1 2 -3 0 0 -1 0] 1.075;

//- fitting parameter a3 for fit U0 - Dimensions: V
a3              a3 [1 2 -3 0 0 -1 0] -1.177;

//- fitting parameter a4 for fit Y0 - Dimensions: A/m²
a4              a4 [0 -2 0 0 0 1 0] 116.859;

//- fitting parameter a5 for fit Y0 - Dimensions: A/m²
a5              a5 [0 -2 0 0 0 1 0] -892.8001;

//- fitting parameter a6 for fit Y0 - Dimensions: A/m²
a6              a6 [0 -2 0 0 0 1 0] 5250.46;

//- fitting parameter a7 for fit Y0 - Dimensions: A/m²
a7              a7 [0 -2 0 0 0 1 0] -13623.09;

//- fitting parameter a8 for fit Y0 - Dimensions: A/m²
a8              a8 [0 -2 0 0 0 1 0] 15853.17;

//- fitting parameter a9 for fit Y0 - Dimensions: A/m²
a9              a9 [0 -2 0 0 0 1 0] -6757.8539;

//- fitting parameter C1 for fit T-dependency of Y - Dimensions: K
C1              C1 [0 0 0 1 0 0 0] 1800;

//- fitting parameter C2 for fit T-dependency of U - Dimensions: V/K
C2              C2 [1 2 -3 -1 0 -1 0] -9.5E-04;



// ************************************************************************* //
