tutorials/electrochemistry/flowAroundBattery/constant/cell/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


// Density - Dimensions: kg/m3
rho             rho [1 -3 0 0 0 0 0] 2000.0;

// Specific heat - Dimensions: J/kg-K
cp              cp  [0 2 -2 -1 0 0 0] 700.0;

// Thermal conductivity - Dimensions: W/m-K
k           	    k [1 1 -3 -1 0 0 0] 5.0;

// electric conductivity positive electrode - Dimensions: S/m
sigmaPos            sigmaPos [-1 -3 3 0 0 2 0] 13.9;

// electric conductivity negative electrode - Dimensions: S/m
sigmaNeg            sigmaNeg [-1 -3 3 0 0 2 0] 100;

// reference Temperature - Dimensions: K
TRef            TRef [0 0 0 1 0 0 0] 298.15;

// specific area of the battery electrodes - Dimensions m²/m³
spArea          spArea [0 -1 0 0 0 0 0] 885000;



// ************************************************************************* //
